vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT555S_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MIMXRT555S_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MIMXRT555S</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="18.0.0" date="2024-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version="17.0.0" date="2023-07-27">NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version="16.0.0" date="2023-01-16">NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version="15.1.0" date="2022-09-28">NXP CMSIS Packs based on MCUXpresso SDK 2.12.1</release>
    <release version="15.0.0" date="2022-07-13">NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version="14.0.0" date="2022-01-05">NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version="13.0.0" date="2021-02-23">NXP CMSIS Packs based on MCUXpresso SDK 2.9.1</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MIMXRT555S" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="true"/>
      <description>MIMXRT555S</description>
      <device Dname="MIMXRT555S">
        <processor Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="200000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MIMXRT555S/iar/MIMXRT555Sxxxx_ram.icf"/>
        </environment>
        <sequences>
          <sequence name="EnableDebugMailbox">
            <block/>
            <control if="!(ReadAP(0x0) &amp; 0x40)">
              <!-- Check AHB-AP CSW DbgStatus to decide if need enable DebugMailbox -->
              <block>
                __var status=0x55aa;
                Message(0, "RT5xx connect srcipt start");
                
                // Read APIDR
                __dp = 0;
                __ap = 2;
                status = ReadAP(0xFC);
                Message(0, "APIDR: 0x%08X", status);
                
                // Read DPIDR
                __dp = 0;
                __ap = 2;
                status = ReadDP(0x0);
                Message(0, "DPIDR: 0x%08X", status);
                
                // Active DebugMailbox
                __dp = 0;
                __ap = 2;
                WriteAP(0x0, 0x00000021);
                DAP_Delay(30000);
                ReadAP(0x0);
                
                // Enter Debug Session
                __dp = 0;
                __ap = 2;
                WriteAP(0x4, 0x00000007);
                DAP_Delay(30000);
                ReadAP(0x0);
                
                __dp = 0;
                __ap = 0;
                
                Message(0, "RT5xx connect srcipt end");
              </block>
            </control>
          </sequence>
          <sequence name="DebugPortStart">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);
              
              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>
            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                  
                  Sequence("EnableDebugMailbox");
                </block>
              </control>
            </control>
          </sequence>
          <sequence name="WaitForStopAfterReset">
            <block>
              __var SCS_Addr    = 0xE000E000;
              __var DHCSR_Addr  = SCS_Addr + 0xDF0;
              __var DFSR_Addr  = SCS_Addr + 0xD30;
              DAP_Delay(100000);  // Give bootloader time to do what it needs to do
              
              Sequence("EnableDebugMailbox");
              Write32(DHCSR_Addr, 0xA05F0003);  // Halt the core in case it didn't stop at a breakpiont.
              // Clear watch point
              Write32(0xE0001020, 0x0);
              Write32(0xE0001028, 0x0);
            </block>
          </sequence>
          <sequence name="ResetHardware">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;
              __var SCS_Addr    = 0xE000E000;
              __var DHCSR_Addr  = SCS_Addr + 0xDF0;
              
              // De-assert nRESET line
              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
            </block>
            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000"/>
            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>
            <control if="!canReadPins">
              <block>
        // Assert nRESET line
        DAP_SWJ_Pins(nReset, nReset, 0);
      </block>
              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000"/>
            </control>
            <control if="(__connection &amp; (1 &lt;&lt; 17)) == 0">
              <block>Sequence("WaitForStopAfterReset");</block>
            </control>
          </sequence>
          <sequence name="TraceStart">
            <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
              <block>// Sequence("EnableTraceClk");       // Enable and configure trace clock</block>
              <control if="SWO_Pin == 0" info="SWO via PIO2_24">
                <block>Write32(0x40004160, 0x00000001); // Configure PIO2_24: FUNC - 1</block>
              </control>
              <control if="SWO_Pin == 1" info="SWO via PIO2_31">
                <block>Write32(0x4000417C, 0x00000005); // Configure PIO2_31: FUNC - 5</block>
              </control>
            </control>
          </sequence>
          <sequence name="ResetSystem">
            <block>
              __dp = 0;
              __ap = 0;
              // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var tmp;
              //Halt the core
              Write32(DHCSR_Addr, 0xA05F0003);
              //clear VECTOR CATCH and set TRCENA
              tmp = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, tmp | 0x1000000);
              // Set watch point at SYSTEM_STICK_CALIB access
              Write32(0xE0001020, 0x50002034);
              Write32(0xE0001028, 0x00000814);
              __errorcontrol = 1;
              // Execute SYSRESETREQ via AIRCR
              Write32(AIRCR_Addr, 0x05FA0004);
              Sequence("WaitForStopAfterReset");
              __errorcontrol = 0;
            </block>
          </sequence>
        </sequences>
        <debugvars configfile="devices/MIMXRT555S/arm/MIMXRT5xx.dbgconf">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = PIO2_24, 1 = PIO2_31
          __var Dbg_CR                = 0x00000000;           // DBG_CR
          __var BootTime              = 10000;                // 10 milliseconds
        </debugvars>
        <memory name="BootROM" start="0x03000000" size="0x020000" access="rx"/>
        <memory name="BootROM_alias" start="0x13000000" size="0x020000" access="rx" alias="BootROM"/>
        <memory name="SRAM" start="0x00080000" size="0x480000" access="rw" default="1"/>
        <memory name="SRAM_ROM" start="0x00000000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_ROM_alias1" start="0x10000000" size="0x020000" access="rx" alias="SRAM_ROM"/>
        <memory name="SRAM_ROM_alias2" start="0x20000000" size="0x020000" access="rx" alias="SRAM_ROM"/>
        <memory name="SRAM_ROM_alias3" start="0x30000000" size="0x020000" access="rx" alias="SRAM_ROM"/>
        <memory name="SRAM_SHARED" start="0x00020000" size="0x060000" access="rw" default="1"/>
        <memory name="SRAM_SHARED_alias1" start="0x10020000" size="0x060000" access="rw" alias="SRAM_SHARED"/>
        <memory name="SRAM_SHARED_alias2" start="0x20020000" size="0x060000" access="rw" alias="SRAM_SHARED"/>
        <memory name="SRAM_SHARED_alias3" start="0x30020000" size="0x060000" access="rw" alias="SRAM_SHARED"/>
        <memory name="SRAM_alias1" start="0x10080000" size="0x480000" access="rw" alias="SRAM"/>
        <memory name="SRAM_alias2" start="0x20080000" size="0x480000" access="rw" alias="SRAM"/>
        <memory name="SRAM_alias3" start="0x30080000" size="0x480000" access="rw" alias="SRAM"/>
        <memory name="USB_RAM" start="0x40140000" size="0x4000" access="rw" default="1"/>
        <memory name="USB_RAM_alias" start="0x50140000" size="0x4000" access="rw" alias="USB_RAM"/>
        <algorithm name="devices/MIMXRT555S/arm/MIMXRT5XX_EVK_FLEXSPI.FLM" start="0x08000000" size="0x04000000" RAMstart="0x1001c000" RAMsize="0x00001000" default="1"/>
        <algorithm name="devices/MIMXRT555S/arm/MIMXRT5XX_EVK_FLEXSPI_S.FLM" start="0x18000000" size="0x04000000" RAMstart="0x1001c000" RAMsize="0x00001000" default="1"/>
        <debug svd="devices/MIMXRT555S/MIMXRT555S.xml"/>
        <variant Dvariant="MIMXRT555SFFOC">
          <compile header="devices/MIMXRT555S/fsl_device_registers.h" define="CPU_MIMXRT555SFFOC"/>
        </variant>
        <variant Dvariant="MIMXRT555SFAWC">
          <compile header="devices/MIMXRT555S/fsl_device_registers.h" define="CPU_MIMXRT555SFAWC"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MIMXRT555S.internal_condition">
      <accept Dname="MIMXRT555SFAWC" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT555SFFOC" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.device=MIMXRT555S.internal_condition">
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT555S.internal_condition"/>
    </condition>
