vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT555S_DFP.pdsc
    <condition id="allOf.component.i2c_mux_pca954x, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.audio_flexcomm_i2s_dma_adapter.condition_id">
      <require condition="allOf.driver.flexcomm_i2s_dma, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_i2s_dma, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2s_dma"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="device.MIMXRT533S.internal_condition">
      <accept Dname="MIMXRT533SFAWC" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT533SFFOC" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MIMXRT595S.internal_condition">
      <accept Dname="MIMXRT595SFAWC" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT595SFFOC" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MIMXRT555S.internal_condition">
      <require condition="anyOf.allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <accept condition="allOf.anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <require condition="anyOf.board=evkmimxrt595, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rt_gpio_adapter"/>
    </condition>
    <condition id="anyOf.board=evkmimxrt595, driver.lpc_gpio.internal_condition">
      <accept condition="board.evkmimxrt595.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="board.evkmimxrt595.internal_condition">
      <accept condition="device.MIMXRT533S.internal_condition"/>
      <accept condition="device.MIMXRT555S.internal_condition"/>
      <accept condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ctimer, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.flash_nand_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexspi, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_i2c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.flexcomm_i2c, device=MIMXRT555S.internal_condition"/>
    </condition>
