vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT555S_DFP.pdsc
    <condition id="anyOf.component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_frdm_rw61x"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rd_rw61x"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am457_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw416"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am457ma.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am510_arduino.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am510_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am510ma.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_cm358_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_88w8987"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_cm358ma.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_nm191_usd.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_nm191ma.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_frdm_rw61x.condition_id">
      <require condition="allOf.component.wifi_bt_module.RW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.component.wifi_bt_module.RW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rw61x"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_k32w061_transceiver.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1xk_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1xk_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1zm_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1zm_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2dl_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw61x"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2dl_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ds_m2.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ds_usd.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2el_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2el_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ll_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ll_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_rd_rw61x.condition_id">
      <require condition="allOf.component.wifi_bt_module.RW61X, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_ubx_jody_w2_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MIMXRT555S.internal_condition"/>
    </condition>
