vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT555S_DFP.pdsc
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_smartdma.condition_id">
      <require condition="allOf.driver.flexio_mculcd, driver.smartdma, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio_mculcd, driver.smartdma, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.flexspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.flexspi_dma.condition_id">
      <require condition="allOf.driver.flexspi, driver.lpc_dma, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexspi, driver.lpc_dma, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.fmeas.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.ft3267.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MIMXRT555S.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.hashcrypt.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.i2s_bridge.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.i3c_dma.condition_id">
      <require condition="allOf.driver.i3c, driver.lpc_dma, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.i3c, driver.lpc_dma, device=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.iap3.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=MIMXRT555S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.lcdif.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.lpc_crc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.lpc_dma.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.lpc_gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.lpc_iopctl.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
    <condition id="driver.lpc_rtc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT555S.internal_condition"/>
    </condition>
