vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT555S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-adv7535" Cversion="1.0.1" condition="driver.display-adv7535.condition_id">
      <description>Driver display-adv7535</description>
      <files>
        <file category="header" name="components/video/display/adv7535/fsl_adv7535.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/adv7535/fsl_adv7535.c" projectpath="video"/>
        <file category="include" name="components/video/display/adv7535/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-co5300" Cversion="1.0.0" condition="driver.display-co5300.condition_id">
      <description>Driver display-co5300</description>
      <files>
        <file category="header" name="components/video/display/co5300/fsl_co5300.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/co5300/fsl_co5300.c" projectpath="video"/>
        <file category="include" name="components/video/display/co5300/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-common" Cversion="1.0.0" condition="driver.display-common.condition_id">
      <description>Driver display-common</description>
      <files>
        <file category="header" name="components/video/display/fsl_display.h" projectpath="video"/>
        <file category="include" name="components/video/display/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-hx8394" Cversion="1.0.0" condition="driver.display-hx8394.condition_id">
      <description>Driver display-hx8394</description>
      <files>
        <file category="header" name="components/video/display/hx8394/fsl_hx8394.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/hx8394/fsl_hx8394.c" projectpath="video"/>
        <file category="include" name="components/video/display/hx8394/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6161" Cversion="1.0.0" condition="driver.display-it6161.condition_id">
      <description>Driver display-it6161</description>
      <files>
        <file category="header" name="components/video/display/it6161/fsl_it6161.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/fsl_it6161.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/hdmi_tx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/hdmi_tx.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/mipi_rx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/mipi_rx.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6161/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6263" Cversion="1.0.1" condition="driver.display-it6263.condition_id">
      <description>Driver display-it6263</description>
      <files>
        <file category="header" name="components/video/display/it6263/fsl_it6263.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6263/fsl_it6263.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6263/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-mipi-dsi-cmd" Cversion="1.0.2" condition="driver.display-mipi-dsi-cmd.condition_id">
      <description>Driver display-mipi-dsi-cmd</description>
      <files>
        <file category="header" name="components/video/display/mipi_dsi_cmd/fsl_mipi_dsi_cmd.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/mipi_dsi_cmd/fsl_mipi_dsi_cmd.c" projectpath="video"/>
        <file category="include" name="components/video/display/mipi_dsi_cmd/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm67162" Cversion="1.0.2" condition="driver.display-rm67162.condition_id">
      <description>Driver display-rm67162</description>
      <files>
        <file category="header" name="components/video/display/rm67162/fsl_rm67162.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm67162/fsl_rm67162.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm67162/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm67191" Cversion="1.1.0" condition="driver.display-rm67191.condition_id">
      <description>Driver display-rm67191</description>
      <files>
        <file category="header" name="components/video/display/rm67191/fsl_rm67191.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm67191/fsl_rm67191.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm67191/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm68191" Cversion="1.1.0" condition="driver.display-rm68191.condition_id">
      <description>Driver display-rm68191</description>
      <files>
        <file category="header" name="components/video/display/rm68191/fsl_rm68191.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm68191/fsl_rm68191.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm68191/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm68200" Cversion="1.1.1" condition="driver.display-rm68200.condition_id">
      <description>Driver display-rm68200</description>
      <files>
        <file category="header" name="components/video/display/rm68200/fsl_rm68200.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm68200/fsl_rm68200.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm68200/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rm692c9" Cversion="1.1.0" condition="driver.display-rm692c9.condition_id">
      <description>Driver display-rm692c9</description>
      <files>
        <file category="header" name="components/video/display/rm692c9/fsl_rm692c9.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rm692c9/fsl_rm692c9.c" projectpath="video"/>
        <file category="include" name="components/video/display/rm692c9/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-rpi" Cversion="1.0.0" condition="driver.display-rpi.condition_id">
      <description>Driver display-rpi</description>
      <files>
        <file category="header" name="components/video/display/rpi/fsl_rpi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/rpi/fsl_rpi.c" projectpath="video"/>
        <file category="include" name="components/video/display/rpi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-sn65dsi83" Cversion="1.0.0" condition="driver.display-sn65dsi83.condition_id">
      <description>Driver display-sn65dsi83</description>
      <files>
        <file category="header" name="components/video/display/sn65dsi83/fsl_sn65dsi83.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/sn65dsi83/fsl_sn65dsi83.c" projectpath="video"/>
        <file category="include" name="components/video/display/sn65dsi83/"/>
      </files>
    </component>
