vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT555S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic" Cversion="2.3.2" condition="driver.dmic.condition_id">
      <description>DMIC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_dmic.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_dmic.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic_dma" Cversion="2.4.2" condition="driver.dmic_dma.condition_id">
      <description>DMIC DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_dmic_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_dmic_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic_hwvad" Cversion="2.3.0" condition="driver.dmic_hwvad.condition_id">
      <description>DMIC HWVAD Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_dmic.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_dmic.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ektf2k" Cversion="1.0.0" condition="driver.ektf2k.condition_id">
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/ektf2k/fsl_ektf2k.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ektf2k/fsl_ektf2k.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ektf2k/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm" Cversion="2.0.2" condition="driver.flexcomm.condition_id">
      <description>FLEXCOMM Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexcomm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexcomm.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.3.3" condition="driver.flexcomm_i2c.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_i2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_i2c.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma" Cversion="2.3.1" condition="driver.flexcomm_i2c_dma.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_i2c_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_i2c_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2s" Cversion="2.3.2" condition="driver.flexcomm_i2s.condition_id">
      <description>i2s Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_i2s.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_i2s.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2s_dma" Cversion="2.3.3" condition="driver.flexcomm_i2s_dma.condition_id">
      <description>i2s Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_i2s_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_i2s_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.3.2" condition="driver.flexcomm_spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.2.2" condition="driver.flexcomm_spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.8.5" condition="driver.flexcomm_usart.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_usart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_usart.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.3.1" condition="driver.flexcomm_usart_dma.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_usart_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_usart_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.3.0" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.6.2" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s" Cversion="2.2.1" condition="driver.flexio_i2s.condition_id">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexio_i2s.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexio_i2s.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd" Cversion="2.3.0" condition="driver.flexio_mculcd.condition_id">
      <description>FLEXIO MCULCD Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexio_mculcd.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexio_mculcd.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd_smartdma" Cversion="2.0.6" condition="driver.flexio_mculcd_smartdma.condition_id">
      <description>FLEXIO MCULCD SMARTDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexio_mculcd_smartdma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexio_mculcd_smartdma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.4.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart" Cversion="2.6.4" condition="driver.flexio_uart.condition_id">
      <description>FLEXIO UART Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT555S/drivers/fsl_flexio_uart.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT555S/drivers/fsl_flexio_uart.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT555S/drivers/"/>
      </files>
    </component>
